{
  "architectures": ["Qwen3_5ForConditionalGeneration"],
  "model_type": "qwen3_5",
  "image_token_id": 248056,
  "video_token_id": 248057,
  "vision_start_token_id": 248053,
  "vision_end_token_id": 248054,
  "tie_word_embeddings": true,
  "transformers_version": "4.57.0.dev0",
  "text_config": {
    "model_type": "qwen3_5_text",
    "attention_bias": false,
    "attention_dropout": 0.0,
    "attn_output_gate": true,
    "dtype": "bfloat16",
    "eos_token_id": 248046,
    "full_attention_interval": 4,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 256,
    "initializer_range": 0.02,
    "intermediate_size": 896,
    "layer_types": [
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention"
    ],
    "linear_conv_kernel_dim": 4,
    "linear_key_head_dim": 64,
    "linear_num_key_heads": 4,
    "linear_num_value_heads": 4,
    "linear_value_head_dim": 64,
    "mamba_ssm_dtype": "float32",
    "max_position_embeddings": 262144,
    "mlp_only_layers": [],
    "mtp_num_hidden_layers": 1,
    "mtp_use_dedicated_embeddings": false,
    "num_attention_heads": 2,
    "num_hidden_layers": 4,
    "num_key_value_heads": 1,
    "rms_norm_eps": 1e-6,
    "rope_parameters": {
      "mrope_interleaved": true,
      "mrope_section": [11, 11, 10],
      "rope_type": "default",
      "rope_theta": 10000000,
      "partial_rotary_factor": 0.25
    },
    "tie_word_embeddings": true,
    "use_cache": true,
    "vocab_size": 248320
  }
}
